Revit 2027 API
ParameterTypeId.GridCenterSegmentWeight Property
 "Center Segment Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridCenterSegmentWeight { get; }
Public Shared ReadOnly Property GridCenterSegmentWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridCenterSegmentWeight {
	ForgeTypeId^ get ();
}
static member GridCenterSegmentWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace